testing/artillery/benchmark-sandbox.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp-up"
    
    # Peak load phase
    - duration: 100
      arrivalRate: 100
      name: "Peak Load"
    
    # High-load stress test
    - duration: 60
      arrivalRate: 150
      rampTo: 200
      name: "Stress Test"

    # Hyperdrive phase (inspiration: omni-relayer benchmark – targets 600 TPS burst)
    - duration: 90
      arrivalRate: 250
      rampTo: 600
      name: "Hyperdrive"

  variables:
    receiverId:
      - "user1.test.near"
      - "user2.test.near" 
      - "user3.test.near"
      - "alice.test.near"
      - "bob.test.near"
    
    amount:
      - "1000000000000000000000000"   # 1 token
      - "5000000000000000000000000"   # 5 tokens
      - "10000000000000000000000000"  # 10 tokens

scenarios:
  - name: "Send FT Token"
    weight: 80
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            receiverId: "{{ receiverId }}"
            amount: "{{ amount }}"
            memo: "Artillery load test - {{ $timestamp }}"
          capture:
            - json: "$.transactionHash"
              as: "txHash"
          expect:
            - statusCode: 200
            - hasProperty: "transactionHash"

  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Batch Transfer"
    weight: 10
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            transfers:
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Batch test"
              - receiverId: "user1.test.near"
                amount: "1000000000000000000000000"
                memo: "Batch test 2"
          expect:
            - statusCode: 200