testing/artillery/benchmark-sandbox.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    timeout: 100
    pool: 200
    maxSockets: 600
  phases:
    # Warm-up phase

    - duration: 60
      arrivalRate: 4
      rampTo: 16
      name: "Warm-up (0-60s)"

    # Ramp to target
    - duration: 75
      arrivalRate: 10
      rampTo: 32
      name: "Ramp to 32 TPS"

    # SUSTAINED LOAD: 6 MINUTES @ 32 TPS
    - duration: 120
      arrivalRate: 35
      name: "Sustain 35 TPS"

    # Cool-down
    - duration: 60
      arrivalRate: 15
      rampTo: 4
      name: "Cool-down (540-600s)"

  variables:
    receiverId:
      - "user1.test.near"
      - "user2.test.near"
      - "user3.test.near"
      - "user4.test.near"
      - "user5.test.near"
      - "alice.test.near"
      - "bob.test.near"
      - "charlie.test.near"
    
    amount:
      - "1000000000000000000000000"   # 1 token (18 decimals)
      - "5000000000000000000000000"   # 5 tokens
      - "10000000000000000000000000"  # 10 tokens
      - "100000000000000000000000"    # 0.1 token

scenarios:
  # Primary scenario: Batch FT transfers (15 transfers per request)
  - name: "Batch FT Transfer (15 transfers)"
    weight: 95
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            transfers:
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 01"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 02"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 03"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 04"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 05"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 06"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 07"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 08"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 09"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 10"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 11"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 12"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 13"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 14"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Sandbox batch 15"
          expect:
            - statusCode: 200
            - json:
                success: true

  # Monitoring: Health checks
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - contentType: json

# Performance assertions for batch transfers
ensure:
  maxErrorRate: 10             # Max 10% error rate (batch transfers can be more complex)
  p95: 8000                    # 95th percentile response time < 8s
  p99: 15000                   # 99th percentile response time < 15s